<a href="https://colab.research.google.com/github/4060E058/2020-AI-/blob/master/1021_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#10 minutes to pandas
This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the Cookbook.

Customarily, we import as follows

In [ ]:
import numpy as np
import pandas as pd

See the Data Structure Intro section.

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [27]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

###索引要改成a,b,c, ....

索引要改成11,12,13,14,15

索引要改成10,20,30,40,50

In [28]:
import numpy as np
import pandas as pd

s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

#Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [15]:
dates = pd.date_range('20130101', periods=6)
dates
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.862662  0.219570  1.821065  1.663916
2013-01-02  1.119873 -0.842714 -1.105295  0.031408
2013-01-03 -0.005998  0.034252  1.233700  0.318510
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612
2013-01-05  0.452661  0.824236 -0.630343 -1.339468
2013-01-06 -0.124686  1.550973  1.117706  1.062672

#Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [24]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20201021'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})
   ...: 
df2

     A          B    C  D      E    F
0  1.0 2020-10-21  1.0  3   test  foo
1  1.0 2020-10-21  1.0  3  train  foo
2  1.0 2020-10-21  1.0  3   test  foo
3  1.0 2020-10-21  1.0  3  train  foo

#DataFrame

In [29]:
df = pd.DataFrame(np.random.randn(6, 4), columns=list('ABCD'))
df
Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns
dates = pd.date_range('20200101', periods=6)
dates
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

SyntaxError: ignored

##錯誤程式訂正題

In [ ]:
df2 = pd.DataFrame({'A': 1.,
           'B': pd.Timestamp('201201021'),
           'C': pd.Series(1, index=list(range(4)), dtype='float32'),
           'D': np.array([3] * 4, dtype='int32'),
           'E': pd.Categorical(["test", "train", "test", "train"]),
           'F': 'foo'})
df2

##錯誤程式訂正題

In [30]:
df2 = pd.DataFrame({'A': 1.,
           'B': pd.Timestamp('20121021'),
           'C': pd.Series(1, index=list(range(46)), dtype='float32'),
           'D': np.array([3] * 4, dtype='int32'),
           'E': pd.Categorical(["test", "train", "test", "train"]),
           'F': 'foo'})
df2

ValueError: ignored

#正確程式

In [31]:
df2 = pd.DataFrame({'A': 1.,
           'B': pd.Timestamp('20121021'),
           'C': pd.Series(1, index=list(range(4)), dtype='float32'),
           'D': np.array([3] * 4, dtype='int32'),
           'E': pd.Categorical(["test", "train", "test", "train"]),
           'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2012-10-21  1.0  3   test  foo
1  1.0 2012-10-21  1.0  3  train  foo
2  1.0 2012-10-21  1.0  3   test  foo
3  1.0 2012-10-21  1.0  3  train  foo

#The columns of the resulting DataFrame have different dtypes.

In [17]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

##If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [23]:
df2.<TAB>  # noqa: E225, E999

SyntaxError: ignored

#Viewing data
See the Basics section.

Here is how to view the top and bottom rows of the frame:

In [34]:
 df.head()

                   A         B         C         D
2013-01-01  0.862662  0.219570  1.821065  1.663916
2013-01-02  1.119873 -0.842714 -1.105295  0.031408
2013-01-03 -0.005998  0.034252  1.233700  0.318510
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612
2013-01-05  0.452661  0.824236 -0.630343 -1.339468

In [35]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612
2013-01-05  0.452661  0.824236 -0.630343 -1.339468
2013-01-06 -0.124686  1.550973  1.117706  1.062672

#Display the index, columns:

In [38]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesn’t require copying data.

In [42]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [41]:
df.to_numpy()

array([[ 0.86266192,  0.21957013,  1.82106457,  1.66391601],
       [ 1.11987266, -0.84271431, -1.10529489,  0.03140833],
       [-0.00599785,  0.03425167,  1.23370019,  0.31851029],
       [-0.8374492 , -1.30000094, -0.30998097,  0.36961227],
       [ 0.45266071,  0.82423603, -0.63034305, -1.33946813],
       [-0.1246861 ,  1.55097331,  1.11770591,  1.06267246]])

For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.

In [40]:
df2.to_numpy()

array([[1.0, Timestamp('2012-10-21 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2012-10-21 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2012-10-21 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2012-10-21 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

describe() shows a quick statistic summary of your data:

In [39]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.244510  0.081053  0.354475  0.351109
std    0.715737  1.048334  1.187328  1.018965
min   -0.837449 -1.300001 -1.105295 -1.339468
25%   -0.095014 -0.623473 -0.550253  0.103184
50%    0.223331  0.126911  0.403862  0.344061
75%    0.760162  0.673070  1.204702  0.889407
max    1.119873  1.550973  1.821065  1.663916

#Transposing your data:

In [44]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.862662    1.119873   -0.005998   -0.837449    0.452661   -0.124686
B    0.219570   -0.842714    0.034252   -1.300001    0.824236    1.550973
C    1.821065   -1.105295    1.233700   -0.309981   -0.630343    1.117706
D    1.663916    0.031408    0.318510    0.369612   -1.339468    1.062672

Sorting by an axis:

In [45]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.663916  1.821065  0.219570  0.862662
2013-01-02  0.031408 -1.105295 -0.842714  1.119873
2013-01-03  0.318510  1.233700  0.034252 -0.005998
2013-01-04  0.369612 -0.309981 -1.300001 -0.837449
2013-01-05 -1.339468 -0.630343  0.824236  0.452661
2013-01-06  1.062672  1.117706  1.550973 -0.124686

#Sorting by values:

In [48]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612
2013-01-02  1.119873 -0.842714 -1.105295  0.031408
2013-01-03 -0.005998  0.034252  1.233700  0.318510
2013-01-01  0.862662  0.219570  1.821065  1.663916
2013-01-05  0.452661  0.824236 -0.630343 -1.339468
2013-01-06 -0.124686  1.550973  1.117706  1.062672

#Getting
Selecting a single column, which yields a Series, equivalent to df.A:

In [49]:
df['A']

2013-01-01    0.862662
2013-01-02    1.119873
2013-01-03   -0.005998
2013-01-04   -0.837449
2013-01-05    0.452661
2013-01-06   -0.124686
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [50]:
df[0:3]

                   A         B         C         D
2013-01-01  0.862662  0.219570  1.821065  1.663916
2013-01-02  1.119873 -0.842714 -1.105295  0.031408
2013-01-03 -0.005998  0.034252  1.233700  0.318510

In [51]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.119873 -0.842714 -1.105295  0.031408
2013-01-03 -0.005998  0.034252  1.233700  0.318510
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612

#Selection by label
See more in Selection by Label.

For getting a cross section using a label:

In [52]:
df.loc[dates[0]]

A    0.862662
B    0.219570
C    1.821065
D    1.663916
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [53]:
 df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.862662  0.219570
2013-01-02  1.119873 -0.842714
2013-01-03 -0.005998  0.034252
2013-01-04 -0.837449 -1.300001
2013-01-05  0.452661  0.824236
2013-01-06 -0.124686  1.550973

Showing label slicing, both endpoints are included:

In [54]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.119873 -0.842714
2013-01-03 -0.005998  0.034252
2013-01-04 -0.837449 -1.300001

Reduction in the dimensions of the returned object:

In [55]:
df.loc['20130102', ['A', 'B']]

A    1.119873
B   -0.842714
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [56]:
df.loc[dates[0], 'A'] #loc位置

0.8626619193445796

For getting fast access to a scalar (equivalent to the prior method):

In [60]:
df.at[dates[0], 'B']

0.21957012599140316

##Selection by position
See more in Selection by Position.

Select via the position of the passed integers:

In [58]:
df.iloc[3]

A   -0.837449
B   -1.300001
C   -0.309981
D    0.369612
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [59]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.837449 -1.300001
2013-01-05  0.452661  0.824236

By lists of integer position locations, similar to the numpy/python style:

In [ ]:
df.iloc[[1, 2, 4], [0, 2]]

For slicing rows explicitly:

In [ ]:
df.iloc[1:3, :]

For slicing columns explicitly:

In [ ]:
df.iloc[:, 1:3]

For getting a value explicitly:

In [ ]:
df.iloc[1, 1]

For getting fast access to a scalar (equivalent to the prior method):

In [ ]:
df.iat[1, 1]

#Boolean indexing
Using a single column’s values to select data.

In [ ]:
df[df['A'] > 0]

Selecting values from a DataFrame where a boolean condition is met.

In [ ]:
df[df > 0]

Using the isin() method for filtering:

In [62]:
df2 = df.copy()

In [67]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [65]:
df2

                   A         B         C         D      E
2013-01-01  0.862662  0.219570  1.821065  1.663916    one
2013-01-02  1.119873 -0.842714 -1.105295  0.031408    one
2013-01-03 -0.005998  0.034252  1.233700  0.318510    two
2013-01-04 -0.837449 -1.300001 -0.309981  0.369612  three
2013-01-05  0.452661  0.824236 -0.630343 -1.339468   four
2013-01-06 -0.124686  1.550973  1.117706  1.062672  three

In [66]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.005998  0.034252  1.233700  0.318510   two
2013-01-05  0.452661  0.824236 -0.630343 -1.339468  four

#Setting¶
Setting a new column automatically aligns the data by the indexes.

In [77]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [78]:
df['F'] = s1

Setting values by label:

In [80]:
df.at[dates[0], 'A'] = 0

Setting values by position:

In [81]:
In [49]: df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [82]:
df.loc[:, 'D'] = np.array([5] * len(df))

The result of the prior setting operations.

In [83]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.821065  5  NaN
2013-01-02  1.119873 -0.842714 -1.105295  5  1.0
2013-01-03 -0.005998  0.034252  1.233700  5  2.0
2013-01-04 -0.837449 -1.300001 -0.309981  5  3.0
2013-01-05  0.452661  0.824236 -0.630343  5  4.0
2013-01-06 -0.124686  1.550973  1.117706  5  5.0

A where operation with setting.

In [86]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.821065 -5  NaN
2013-01-02 -1.119873 -0.842714 -1.105295 -5 -1.0
2013-01-03 -0.005998 -0.034252 -1.233700 -5 -2.0
2013-01-04 -0.837449 -1.300001 -0.309981 -5 -3.0
2013-01-05 -0.452661 -0.824236 -0.630343 -5 -4.0
2013-01-06 -0.124686 -1.550973 -1.117706 -5 -5.0

#Missing data
##pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [87]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E']) #dates日期 colums
df1.loc[dates[0]:dates[1], 'E'] = 1    #設兩行值
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.821065  5  NaN  1.0
2013-01-02  1.119873 -0.842714 -1.105295  5  1.0  1.0
2013-01-03 -0.005998  0.034252  1.233700  5  2.0  NaN
2013-01-04 -0.837449 -1.300001 -0.309981  5  3.0  NaN

To drop any rows that have missing data.

In [88]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.119873 -0.842714 -1.105295  5  1.0  1.0

Filling missing data.

In [90]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.821065  5  5.0  1.0
2013-01-02  1.119873 -0.842714 -1.105295  5  1.0  1.0
2013-01-03 -0.005998  0.034252  1.233700  5  2.0  5.0
2013-01-04 -0.837449 -1.300001 -0.309981  5  3.0  5.0

To get the boolean mask where values are nan.

In [89]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

#10 minutes to pandas
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#minutes-to-pandas

In [43]:
!https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#minutes-to-pandas

/bin/bash: https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#minutes-to-pandas: No such file or directory